
## Plan Result (image-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/12808)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * local_file.application_ecs_service_appspec_94386B9C


<details><summary>Change Result (Click me)</summary>

```hcl

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = jsonencode(
            {
              + Resources = [
                  + {
                      + TargetService = {
                          + Properties = {
                              + LoadBalancerInfo = {
                                  + ContainerName = "app"
                                  + ContainerPort = 4867
                                }
                              + TaskDefinition   = "arn:aws:ecs:us-east-1:996905175585:task-definition/ImageAPI-Prod:119"
                            }
                          + Type       = "AWS::ECS::Service"
                        }
                    },
                ]
              + version   = 1
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Warning: Deprecated attribute
│ 
│   on cdk.tf.json line 2035, in resource.aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84:
│ 2035:         "endpoint": "https://events.pagerduty.com/integration/${pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5.integration_key}/enqueue",
│ 
│ The attribute "integration_key" is deprecated. Refer to the provider
│ documentation for details.
│ 
│ (and 3 more similar warnings elsewhere)
╵
```

</details>



## :warning: Warnings

```hcl
Warning: Deprecated attribute
 
   on cdk.tf.json line 2035, in resource.aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84:
 2035:         "endpoint": "https://events.pagerduty.com/integration/${pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5.integration_key}/enqueue",
 
 The attribute "integration_key" is deprecated. Refer to the provider
 documentation for details.
 
 (and 3 more similar warnings elsewhere)
```



<!-- github-comment: {"Command":"plan","JobID":"a91d69b7-e668-471c-87fc-f5d87189b497","JobName":"image-api_infrastructure_plan_prod","PRNumber":72,"Program":"tfcmt","SHA1":"8e73b12a7da06a7b876a7255c993c591c8250b38","Target":"image-api-cdk","Vars":{}} -->